src/Catalogs/ВидыКонфигураций/ВидыКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонфигураций</name>
  <predefined>
    <items>
      <name>БухгалтерияПредприятия</name>
      <description>БухгалтерияПредприятия</description>
    </items>
    <items>
      <name>БухгалтерияПредприятияКОРП</name>
      <description>БухгалтерияПредприятияКОРП</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналом</name>
      <description>ЗарплатаИУправлениеПерсоналом</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналомКОРП</name>
      <description>ЗарплатаИУправлениеПерсоналомКОРП</description>
    </items>
    <items>
      <name>Метрология</name>
      <description>Метрология</description>
    </items>
    <items>
      <name>ОхранаОкружающейСреды</name>
      <description>Охрана окружающей среды</description>
    </items>
    <items>
      <name>УправлениеНСИ</name>
      <description>Управление НСИ</description>
    </items>
    <items>
      <name>УправлениеУчебнымЦентром</name>
      <description>Управление учебным центром</description>
    </items>
    <items>
      <name>УправлениеПредприятием</name>
      <description>Управление холдингом</description>
    </items>
    <items>
      <name>УправлениеХолдингом</name>
      <description>УправлениеХолдингом</description>
    </items>
    <items>
      <name>УправлениеХолдингомERP</name>
      <description>УправлениеХолдингомERP</description>
    </items>
  </predefined>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыКонфигураций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВидыКонфигураций();
	
КонецПроцедуры

Процедура ЗаполнитьВидыКонфигураций()
	
	ОписатьВидКонфигурации("БухгалтерияПредприятия", 
		"БухгалтерияПредприятия", "Бухгалтерия предприятия, редакция 3.0", "Accounting");

	ОписатьВидКонфигурации("БухгалтерияПредприятияКОРП", 
		"БухгалтерияПредприятияКОРП", "Бухгалтерия предприятия КОРП, редакция 3.0", "AccountingCorp");

	ОписатьВидКонфигурации("ЗарплатаИУправлениеПерсоналом", 
		"ЗарплатаИУправлениеПерсоналом", "Зарплата и управление персоналом, редакция 3.1", "HRM");

	ОписатьВидКонфигурации("ЗарплатаИУправлениеПерсоналомКОРП", 
		"ЗарплатаИУправлениеПерсоналомКОРП", "Зарплата и управление персоналом КОРП, редакция 3.1", "HRMCorp");

	ОписатьВидКонфигурации("УправлениеПредприятием", 
		"УправлениеПредприятием", "1С:ERP Управление предприятием 2", "Enterprise20");

	ОписатьВидКонфигурации("УправлениеХолдингом", 
		"УправлениеХолдингом", "Управление холдингом, редакция 3.2", "CPM");

	ОписатьВидКонфигурации("УправлениеХолдингомERP", 
		"УправлениеХолдингомERP", "1С:ERP. Управление холдингом", "ERP_UH");
	
	
	
	ОписатьВидКонфигурации("УправлениеУчебнымЦентром", 
		"УправлениеУчебнымЦентром", "Управление учебным центром, редакция 2.0", "UUC");

	ОписатьВидКонфигурации("Метрология", 
		"Метрология", "ИС Метрология, редакция 3.0", "MetrologyXDBI");

	ОписатьВидКонфигурации("ОхранаОкружающейСреды", 
		"ОхранаОкружающейСреды", "1С:Экология. Охрана окружающей среды КОРП, редакция 2.0", "ooscorp");

	ОписатьВидКонфигурации("УправлениеНСИ", 
		"УправлениеНСИ", "1С:MDM Управление нормативно-справочной информацией, редакция 2.5", "MDM");
	
КонецПроцедуры

Процедура ОписатьВидКонфигурации(ИмяПредопределенныхДанных, Наименование, Синоним, КодПрограммы) Экспорт
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонфигураций." + ИмяПредопределенныхДанных);
	
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВидыКонфигураций.СоздатьЭлемент();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Если Элемент.Наименование <> Наименование Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	
	Если Элемент.Синоним <> Синоним Тогда
		Элемент.Синоним = Синоним;
	КонецЕсли;
	
	Если Элемент.КодПрограммы <> КодПрограммы Тогда
		Элемент.КодПрограммы = КодПрограммы;
	КонецЕсли;
	
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
